docs/presentation.tex
% Created 2018-03-14 Wed 13:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Wilson Chang}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Wilson Chang},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Resources}
\label{sec:orgdc0f023}
\begin{itemize}
\item \href{https://drive.google.com/drive/u/0/folders/1Yxj9OBGIWcbHoHPgwoU0kEoxn\_60bCrN}{google drive folder}
\end{itemize}

\section{Problem Statement}
\label{sec:orgb7afa7e}
Underactuated flying vehicle that is more cost and energy efficient.
\section{Motivation}
\label{sec:org8bd048b}
Modern Rocket uses 2 DOF revolute joint to turn the nozzle to control the thrust. Challenges are it has to resist a very high temperature and the joint need a large amount of energy to keep the nozzle in a specific direction.
Instead, a precisely controlled off-center mass in the front of the rocket can create a torque that steers the Rocket.
\subsection{{\bfseries\sffamily TODO} Add pictures to the slides -- structure of modern Rocket, look more into how modern Rocket operates}
\label{sec:org9d6b0e3}
\section{Scope}
\label{sec:org3d62fa5}
In this project we will focus on the Mathematical Formulation and the design of controller. We will build on a working quadcopter where all 4 propellers will provide same constant thrust.
\subsection{{\bfseries\sffamily TODO} Add quadcopter pics?}
\label{sec:orgc481719}

\section{Detailed Context / Related work}
\label{sec:orge571f01}
\subsection{{\bfseries\sffamily TODO} Draw a box diagram for our system}
\label{sec:org97ad50a}
\subsection{{\bfseries\sffamily TODO} Maybe look more into \href{https://www.upenn.edu/spotlights/meet-piccolissimo-worlds-smallest-self-powered-controllable-flying-vehicle}{Piccolissimo} and relate the two?}
\label{sec:orgd2aeba8}

\section{Tasks breakdown, potential challenges}
\label{sec:org57996fc}
\begin{enumerate}
\item Mathematical Formulation
\begin{itemize}
\item Analysis of the system dynamic
\item How does a spinning mass create torque
\item How does the created torque affect the orientation of the system
\item The desired roll / pitch angle for system stability
\item The spinning mass dynamic
\end{itemize}
\item Pick our components
\begin{itemize}
\item Hackable Quadcopter
\item A motor with pulse control that we can make the spinning mass stay longer in one direction
\item What mass to attach? What arm to connect motor and mass?
\item Mechanical device that enable us to mount our system on the Quadcopter: MAY NEED 3D PRINTING
\item Microcontroller
\item IMU for sensor measurements
\item Wireless module for communication
\item Battery
\end{itemize}
\item Simulation environment: maybe challenging because we working in 3D
\begin{itemize}
\item Simulation in Matlab
\item State (orientation) estimation
\item How does motor inputs generate torque and in turn affect the orientation
\item Controller simulation
\end{itemize}
\item Hack the quadcopter
\begin{itemize}
\item Be able to control the 4 propellers using our wireless module thru our microcontroller
\end{itemize}
\item Sensor Fusion
\begin{itemize}
\item Configure the IMU, making use of accelerometer and gyroscope
\item Determine the rate of roll/pitch angle change
\end{itemize}
\item Control circuit for motor
\begin{itemize}
\item make sure the motor is doing what it is supposed to before mounting it on quadcopter
\item Design a test to show that the off-center mass is leaning on one side
\end{itemize}
\item Putting it together
\begin{itemize}
\item Integrate all our working components (wireless communication, motor pulse control, sensor fusion, simulation works)
\item Mount it on the quadcopter
\end{itemize}
\item Controller Design
\begin{itemize}
\item Real experimental results should be available since we already built our system and mount it on quadcopter
\item controls the input to the motor and the propellers, by taking in state estimation and sensor measurements
\item Responsible to achieve the desired roll/pitch angle to steer the vehicle
\item Moreover, to stabilize the quadcopter from a moving position.
\end{itemize}
\item End-to-End testing
\item Documentation
\end{enumerate}
\subsection{{\bfseries\sffamily TODO} Put the above tasks breakdown in the slides? Each big topic (1,2,3) with one slide?}
\label{sec:org0f6d4b6}
\section{Project plan}
\label{sec:orgfacdad9}
\begin{center}
\begin{tabular}{rll}
Week & Milestone(s) & Demonstration\\
\hline
1 & Pick our components & Reason choosing these parts\\
1-2 & Hack the quadcopter & Controll the quadcopter with Arduino code\\
1-2 & Mathematcial Formulation & Show our mathematical model\\
3 & Sensor Fusion & Demonstrate angle change / vector graph\\
3-4 & Control circuit for motor & Test: falling on desire side\\
3-4 & Develop Matlab Simulation & Show simulation graph\\
5 & Putting everything together & Show our modified quadcopter: video demo?\\
5-8 & Controller Design & Show how quadcopter reacts with different controllers\\
9 & End-to-end testing & Gather experimental results that supports our conclusion\\
10 & Documentation & Document all our work\\
\end{tabular}
\end{center}
\subsection{{\bfseries\sffamily TODO} Create a Gantt chart based on the above table}
\label{sec:orgee88eca}
\section{Expected Conclusion}
\label{sec:orgc592c37}
We would like to conclude that a off center spinning mass is able to steer the quadcopter using the system's dynamic; and that such principle can be apply on Rocket for more effective way of stering a rocket.
\subsection{{\bfseries\sffamily TODO} PUTIT ON THE SLIDE! I am bad with wording, maybe refine the above sentence a bit / any missing conclusion you guys want to draw?}
\label{sec:org7643dd6}
\end{document}